Ext.define('MyApp.store.Type3', {
    extend: 'Ext.data.Store',
    
    requires: [
        'MyApp.model.Type3'
    ],

    constructor: function(cfg) {
        var me = this;
        cfg = cfg || {};
        
        me.callParent([Ext.apply({
            storeId: 'Type3',
            model: 'MyApp.model.Type3',
            data: [
               	{sw: '거제시' , value1: 1177108.438 , value2: 468524.9262 , value3: 56590.5317 , value4: 32524.94082 , value5: 32220.13398 , value6: 3994.382832},
				{sw: '거창군' , value1: 2129894.038 , value2: 211971.2143 , value3: 25462.88745 , value4: 3720.834455 , value5: 8277.707281 , value6: 1034.974174},
				{sw: '고성군' , value1: 3218414.937 , value2: 68998046.12 , value3: 6545670.677 , value4: 23331.35934 , value5: 41847.43142 , value6: 4648.858667},
				{sw: '김해시' , value1: 8804922.448 , value2: 1127102.777 , value3: 117549.3199 , value4: 48474.04494 , value5: 55826.97206 , value6: 4435.85826},
				{sw: '밀양시' , value1: 854335.7094 , value2: 54134.96222 , value3: 11455.65713 , value4: 8736.921319 , value5: 9885.4068 , value6: 979.783707},
				{sw: '사천시' , value1: 1584759.914 , value2: 373998.0019 , value3: 61705.22264 , value4: 141426.4 , value5: 96250.87104 , value6: 11024.73274},
				{sw: '산청군' , value1: 32627.75 , value2: 31150.885 , value3: 1910.13 , value4: 3649.144347 , value5: 2408.375931 , value6: 408.0653511},
				{sw: '양산시' , value1: 24554912.19 , value2: 1893078.899 , value3: 571912.0026 , value4: 114191.2551 , value5: 162158.8152 , value6: 19007.21472},
				{sw: '의령군' , value1: 2696274.16 , value2: 111247.326 , value3: 15097.892 , value4: 33021.49913 , value5: 22418.35192 , value6: 2012.540105},
				{sw: '진주시' , value1: 26173764.76 , value2: 1408411.588 , value3: 293507.8858 , value4: 172832.3685 , value5: 145692.9871 , value6: 6257.489099},
				{sw: '창녕군' , value1: 2382129.986 , value2: 332590.6888 , value3: 9699.604725 , value4: 32940.55713 , value5: 29840.61472 , value6: 2083.803521},
				{sw: '창원시마산합포구' , value1: 268110.9619 , value2: 43806.29731 , value3: 4240.189347 , value4: 49035.76627 , value5: 126178.9188 , value6: 8106.607995},
				{sw: '창원시마산회원구' , value1: 11243468.05 , value2: 143373764.5 , value3: 188662.3882 , value4: 3873.86 , value5: 2466.7469 , value6: 286.3733},
				{sw: '창원시성산구' , value1: 1162201.511 , value2: 1214104.244 , value3: 277283.0694 , value4: 3115.4 , value5: 15755.8946 , value6: 273.3575},
				{sw: '창원시의창구' , value1: 7266333.521 , value2: 467286.3819 , value3: 108868.1934 , value4: 4710.815996 , value5: 7016.398772 , value6: 1276.915982},
				{sw: '창원시진해구' , value1: 1563516.078 , value2: 538832.8788 , value3: 142339.1277 , value4: 19744.23395 , value5: 14138.18155 , value6: 481.9719577},
				{sw: '통영시' , value1: 1340809.622 , value2: 189181.7128 , value3: 30724.2272 , value4: 12573.08118 , value5: 21418.78757 , value6: 1556.905066},
				{sw: '하동군' , value1: 229154.6811 , value2: 135230.9525 , value3: 7883.600841 , value4: 48117.35258 , value5: 104395.665 , value6: 5020.092025},
				{sw: '함안군' , value1: 35280728.83 , value2: 3099598.205 , value3: 281038.3934 , value4: 51240.72415 , value5: 54119.87506 , value6: 5988.292319},
				{sw: '함양군' , value1: 649541.433 , value2: 68147.98724 , value3: 25063.03042 , value4: 18913.20051 , value5: 6388.025087 , value6: 2347.671606},
				{sw: '합천군' , value1: 33678.917 , value2: 24521.16867 , value3: 2050.299865 , value4: 8412.609729 , value5: 6430.972725 , value6: 613.0406436}
            ]
        }, cfg)]);
    }
});